# Pandas

1. **Descriptive**
2. **Missing Values**
3. **Graphs /Plotting**
4. **Joins**
5. **Reindexing**
6. **Misc**
7. **Data reader from web need to revisit by RP**

In [1]:
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"
import numpy as np
import pandas as pd
import pandas_datareader as pdr
from pandas_datareader import data, wb
import pandas_datareader.data as web
import datetime
import matplotlib.pyplot as plt
%matplotlib inline
start = datetime.datetime(2017, 5, 1)
end = datetime.datetime(2017, 5, 31)

1. 1D data is called series data
2. 2D data is called dataframe data
3. 3D and above data is called panel data

In [2]:
Dataset="../Datasets"

**There are 3 type of Data structure in pandas**
1. Series: It is 1D array which assign index to each value.
2. Dataframe: It is 2D array. Its a tabular data structure.
3. Panel: It has 3 dimensional and more dimensional array.

In [3]:
data=pd.DataFrame({'price':[95,25,81,78,89],
                   'ticker':['AXP','CSCO','DIS','MSFT','WMT'],
                   'company':['American Express','Cisco','Walt Disney','Microsoft','Walmart']})
data

            company  price ticker
0  American Express     95    AXP
1             Cisco     25   CSCO
2       Walt Disney     81    DIS
3         Microsoft     78   MSFT
4           Walmart     89    WMT

In [4]:
data['pricesquared']=data.price**2
data['sqrtprice']=np.sqrt(data.pricesquared)
data

            company  price ticker  pricesquared  sqrtprice
0  American Express     95    AXP          9025       95.0
1             Cisco     25   CSCO           625       25.0
2       Walt Disney     81    DIS          6561       81.0
3         Microsoft     78   MSFT          6084       78.0
4           Walmart     89    WMT          7921       89.0

In [5]:
del data['pricesquared']
data

            company  price ticker  sqrtprice
0  American Express     95    AXP       95.0
1             Cisco     25   CSCO       25.0
2       Walt Disney     81    DIS       81.0
3         Microsoft     78   MSFT       78.0
4           Walmart     89    WMT       89.0

In [6]:
data['pricesquared']=np.NaN
data['sqrtprice']=np.NaN
data

            company  price ticker  sqrtprice  pricesquared
0  American Express     95    AXP        NaN           NaN
1             Cisco     25   CSCO        NaN           NaN
2       Walt Disney     81    DIS        NaN           NaN
3         Microsoft     78   MSFT        NaN           NaN
4           Walmart     89    WMT        NaN           NaN

In [7]:
data['sequence']=np.arange(0,25,5)
data

            company  price ticker  sqrtprice  pricesquared  sequence
0  American Express     95    AXP        NaN           NaN         0
1             Cisco     25   CSCO        NaN           NaN         5
2       Walt Disney     81    DIS        NaN           NaN        10
3         Microsoft     78   MSFT        NaN           NaN        15
4           Walmart     89    WMT        NaN           NaN        20

In [8]:
newdata= data.drop(['pricesquared','sqrtprice'],axis=1)
another_newdata= data.drop(['sequence'], axis=1)
another_newdata
newdata
data

            company  price ticker  sqrtprice  pricesquared
0  American Express     95    AXP        NaN           NaN
1             Cisco     25   CSCO        NaN           NaN
2       Walt Disney     81    DIS        NaN           NaN
3         Microsoft     78   MSFT        NaN           NaN
4           Walmart     89    WMT        NaN           NaN

            company  price ticker  sequence
0  American Express     95    AXP         0
1             Cisco     25   CSCO         5
2       Walt Disney     81    DIS        10
3         Microsoft     78   MSFT        15
4           Walmart     89    WMT        20

            company  price ticker  sqrtprice  pricesquared  sequence
0  American Express     95    AXP        NaN           NaN         0
1             Cisco     25   CSCO        NaN           NaN         5
2       Walt Disney     81    DIS        NaN           NaN        10
3         Microsoft     78   MSFT        NaN           NaN        15
4           Walmart     89    WMT        NaN           NaN        20

In [9]:
year=[90,91,92,93,94,95]
f1={90:1,91:2,92:3,93:4,94:5,95:6}
firm1=pd.Series(f1,index=year)
firm1
f2={90:10,92:11,93:12,94:13}
firm2=pd.Series(f2,index=year)
firm2
f3={93:20,94:21,95:23}
firm3=pd.Series(f3,index=year)
firm3

90    1
91    2
92    3
93    4
94    5
95    6
dtype: int64

90    10.0
91     NaN
92    11.0
93    12.0
94    13.0
95     NaN
dtype: float64

90     NaN
91     NaN
92     NaN
93    20.0
94    21.0
95    23.0
dtype: float64

In [10]:
df1=pd.DataFrame(columns=('firm1','firm2','firm3'),index=year)

In [11]:
df1

   firm1 firm2 firm3
90   NaN   NaN   NaN
91   NaN   NaN   NaN
92   NaN   NaN   NaN
93   NaN   NaN   NaN
94   NaN   NaN   NaN
95   NaN   NaN   NaN

In [12]:
df1.firm1=firm1
df1.firm2=firm2
df1.firm3=firm3
df1

    firm1  firm2  firm3
90      1   10.0    NaN
91      2    NaN    NaN
92      3   11.0    NaN
93      4   12.0   20.0
94      5   13.0   21.0
95      6    NaN   23.0

```Above creation and initialization of df1 dataframe can be written in one single line like this```
```
df1=pd.DataFrame({'firm1':firm1,'firm2':firm2,'firm3':firm3},index=year)
```

In [13]:
df1['firm4']=np.NaN

In [14]:
del df1['firm4']

In [15]:
df1

    firm1  firm2  firm3
90      1   10.0    NaN
91      2    NaN    NaN
92      3   11.0    NaN
93      4   12.0   20.0
94      5   13.0   21.0
95      6    NaN   23.0

In [16]:
df1T=df1.T
df1T

         90   91    92    93    94    95
firm1   1.0  2.0   3.0   4.0   5.0   6.0
firm2  10.0  NaN  11.0  12.0  13.0   NaN
firm3   NaN  NaN   NaN  20.0  21.0  23.0

In [17]:
del df1T[90]

In [18]:
df1T
df1

        91    92    93    94    95
firm1  2.0   3.0   4.0   5.0   6.0
firm2  NaN  11.0  12.0  13.0   NaN
firm3  NaN   NaN  20.0  21.0  23.0

    firm1  firm2  firm3
90      1   10.0    NaN
91      2    NaN    NaN
92      3   11.0    NaN
93      4   12.0   20.0
94      5   13.0   21.0
95      6    NaN   23.0

# Reindexing

In [19]:
df1
reindex_df1=df1.reindex([88,89,90,91,92,93,94,95,96,97,98])
reindex_df1

    firm1  firm2  firm3
90      1   10.0    NaN
91      2    NaN    NaN
92      3   11.0    NaN
93      4   12.0   20.0
94      5   13.0   21.0
95      6    NaN   23.0

    firm1  firm2  firm3
88    NaN    NaN    NaN
89    NaN    NaN    NaN
90    1.0   10.0    NaN
91    2.0    NaN    NaN
92    3.0   11.0    NaN
93    4.0   12.0   20.0
94    5.0   13.0   21.0
95    6.0    NaN   23.0
96    NaN    NaN    NaN
97    NaN    NaN    NaN
98    NaN    NaN    NaN

In [20]:
reindex_df=df1.reindex(np.arange(1988,2008))
reindex_df

      firm1  firm2  firm3
1988    NaN    NaN    NaN
1989    NaN    NaN    NaN
1990    NaN    NaN    NaN
1991    NaN    NaN    NaN
1992    NaN    NaN    NaN
1993    NaN    NaN    NaN
1994    NaN    NaN    NaN
1995    NaN    NaN    NaN
1996    NaN    NaN    NaN
1997    NaN    NaN    NaN
1998    NaN    NaN    NaN
1999    NaN    NaN    NaN
2000    NaN    NaN    NaN
2001    NaN    NaN    NaN
2002    NaN    NaN    NaN
2003    NaN    NaN    NaN
2004    NaN    NaN    NaN
2005    NaN    NaN    NaN
2006    NaN    NaN    NaN
2007    NaN    NaN    NaN

In [21]:
year1=[90,91,92,93,94,95]
f4={90:8,91:9,92:10,93:11,94:12,95:13}
firm4=pd.Series(f4,index=year1)
f5={90:14,91:15,92:16,93:17,94:18,95:19}
firm5=pd.Series(f5,index=year1)
f6={90:8,91:9,92:9,93:10,94:12,95:13}
firm6=pd.Series(f6,index=year1)
df2=pd.DataFrame({'firm1':firm4,'firm2':firm5,'firm3':firm6},index=year1)

In [22]:
df2

    firm1  firm2  firm3
90      8     14      8
91      9     15      9
92     10     16      9
93     11     17     10
94     12     18     12
95     13     19     13

# Missing Value treatment

In [23]:
reindex_df2=df2.reindex([88,89,90,91,92,93,94,95,96,97,98])
reindex_df2

    firm1  firm2  firm3
88    NaN    NaN    NaN
89    NaN    NaN    NaN
90    8.0   14.0    8.0
91    9.0   15.0    9.0
92   10.0   16.0    9.0
93   11.0   17.0   10.0
94   12.0   18.0   12.0
95   13.0   19.0   13.0
96    NaN    NaN    NaN
97    NaN    NaN    NaN
98    NaN    NaN    NaN

In [24]:
reindex_df2=df2.reindex([88,89,90,91,92,93,94,95,96,97,98],fill_value=0)
reindex_df2

    firm1  firm2  firm3
88      0      0      0
89      0      0      0
90      8     14      8
91      9     15      9
92     10     16      9
93     11     17     10
94     12     18     12
95     13     19     13
96      0      0      0
97      0      0      0
98      0      0      0

In [25]:
reindex_df2=df2.reindex([88,89,90,91,92,93,94,95,96,97,98])
reindex_df2

    firm1  firm2  firm3
88    NaN    NaN    NaN
89    NaN    NaN    NaN
90    8.0   14.0    8.0
91    9.0   15.0    9.0
92   10.0   16.0    9.0
93   11.0   17.0   10.0
94   12.0   18.0   12.0
95   13.0   19.0   13.0
96    NaN    NaN    NaN
97    NaN    NaN    NaN
98    NaN    NaN    NaN

**bfill/backfill** − Fill values backward the time it encounter data it check immediate previous null value if its null it fill it with that encountered data.

In [26]:
reindex_df2=df2.reindex([88,89,90,91,92,93,94,95,96,97,98],method='bfill')
reindex_df2

    firm1  firm2  firm3
88    8.0   14.0    8.0
89    8.0   14.0    8.0
90    8.0   14.0    8.0
91    9.0   15.0    9.0
92   10.0   16.0    9.0
93   11.0   17.0   10.0
94   12.0   18.0   12.0
95   13.0   19.0   13.0
96    NaN    NaN    NaN
97    NaN    NaN    NaN
98    NaN    NaN    NaN

In [27]:
reindex_df2=df2.reindex([88,89,90,91,92,93,94,95,96,97,98])
reindex_df2

    firm1  firm2  firm3
88    NaN    NaN    NaN
89    NaN    NaN    NaN
90    8.0   14.0    8.0
91    9.0   15.0    9.0
92   10.0   16.0    9.0
93   11.0   17.0   10.0
94   12.0   18.0   12.0
95   13.0   19.0   13.0
96    NaN    NaN    NaN
97    NaN    NaN    NaN
98    NaN    NaN    NaN

**pad/ffill** − Fill values forward, the time it encounter data it check immediate next value if its null value fill it with that encountered data.

In [28]:
reindex_df2=df2.reindex([88,89,90,91,92,93,94,95,96,97,98],method='ffill')
reindex_df2

    firm1  firm2  firm3
88    NaN    NaN    NaN
89    NaN    NaN    NaN
90    8.0   14.0    8.0
91    9.0   15.0    9.0
92   10.0   16.0    9.0
93   11.0   17.0   10.0
94   12.0   18.0   12.0
95   13.0   19.0   13.0
96   13.0   19.0   13.0
97   13.0   19.0   13.0
98   13.0   19.0   13.0

In [29]:
reindex_df2=df2.reindex([88,89,90,91,92,93,94,95,96,97,98])
reindex_df2

    firm1  firm2  firm3
88    NaN    NaN    NaN
89    NaN    NaN    NaN
90    8.0   14.0    8.0
91    9.0   15.0    9.0
92   10.0   16.0    9.0
93   11.0   17.0   10.0
94   12.0   18.0   12.0
95   13.0   19.0   13.0
96    NaN    NaN    NaN
97    NaN    NaN    NaN
98    NaN    NaN    NaN

In [30]:
reindex_df2=df2.reindex([88,89,90,91,92,93,94,95,96,97,98],fill_value=999)
reindex_df2

    firm1  firm2  firm3
88    999    999    999
89    999    999    999
90      8     14      8
91      9     15      9
92     10     16      9
93     11     17     10
94     12     18     12
95     13     19     13
96    999    999    999
97    999    999    999
98    999    999    999

randn: 
``` 
generate random sample from standard normal distribution.
```
seed:
``` 
Maintains the randomness.
```

In [31]:
np.random.seed(2)
datf=pd.DataFrame(np.random.randn(3,3),columns=['one','two','three'])
datf

        one       two     three
0 -0.416758 -0.056267 -2.136196
1  1.640271 -1.793436 -0.841747
2  0.502881 -1.245288 -1.057952

In [32]:
np.abs(datf)

        one       two     three
0  0.416758  0.056267  2.136196
1  1.640271  1.793436  0.841747
2  0.502881  1.245288  1.057952

In [33]:
f=lambda x:x.max() - x.min()
datf.apply(f)

one      2.057029
two      1.737169
three    1.294449
dtype: float64

In [34]:
datf.apply(f,axis=1)

0    2.079929
1    3.433706
2    1.748170
dtype: float64

In [35]:
datf
f2=lambda x: x - np.mean(x)

datf.iloc[0,0]
np.mean(datf,axis=1)
datf.iloc[0,0] -np.mean(datf)
datf.apply(f2)

datf.iloc[0,0]
np.mean(datf)
datf.iloc[0,0] -np.mean(datf)
datf.apply(f2,axis=1)

        one       two     three
0 -0.416758 -0.056267 -2.136196
1  1.640271 -1.793436 -0.841747
2  0.502881 -1.245288 -1.057952

-0.41675784740547062

0   -0.869740
1   -0.331637
2   -0.600120
dtype: float64

one     -0.992223
two      0.614906
three    0.928541
dtype: float64

        one       two     three
0 -0.992223  0.975397 -0.790898
1  1.064806 -0.761772  0.503551
2 -0.072583 -0.213625  0.287346

-0.41675784740547062

one      0.575465
two     -1.031663
three   -1.345299
dtype: float64

one     -0.992223
two      0.614906
three    0.928541
dtype: float64

        one       two     three
0  0.452982  0.813473 -1.266456
1  1.971908 -1.461798 -0.510110
2  1.103001 -0.645168 -0.457833

In [36]:
def stats(x):
    return pd.Series([np.mean(x),x.max(),x.min(),x.max()-x.min()],index=['Mean','Max','Min','Range'])

In [37]:
datf
datf.apply(stats, axis=1)
datf.apply(stats)

        one       two     three
0 -0.416758 -0.056267 -2.136196
1  1.640271 -1.793436 -0.841747
2  0.502881 -1.245288 -1.057952

       Mean       Max       Min     Range
0 -0.869740 -0.056267 -2.136196  2.079929
1 -0.331637  1.640271 -1.793436  3.433706
2 -0.600120  0.502881 -1.245288  1.748170

            one       two     three
Mean   0.575465 -1.031663 -1.345299
Max    1.640271 -0.056267 -0.841747
Min   -0.416758 -1.793436 -2.136196
Range  2.057029  1.737169  1.294449

## Sorting

```Note: Sorting by lable will sort only those lable rest will follow. In below we sort by lable 'three' so only column three is sorted and rest on same row follows```

```Eg: in lable 'three' value -0.841747 is the largest and '1.640271' '-1.793436' are in the same row and they just follows.```

In [38]:
datf
# sort_index is deprecated alternative is to use sort_values

#datf.sort_index(by='three' ,ascending=False)
print("Using 'sort_values' since 'sort_index' is depricated")
datf.sort_values(by='three',ascending=False)

        one       two     three
0 -0.416758 -0.056267 -2.136196
1  1.640271 -1.793436 -0.841747
2  0.502881 -1.245288 -1.057952

Using 'sort_values' since 'sort_index' is depricated

        one       two     three
1  1.640271 -1.793436 -0.841747
2  0.502881 -1.245288 -1.057952
0 -0.416758 -0.056267 -2.136196

In [39]:
datf
datf.std()

        one       two     three
0 -0.416758 -0.056267 -2.136196
1  1.640271 -1.793436 -0.841747
2  0.502881 -1.245288 -1.057952

one      1.030433
two      0.888068
three    0.693416
dtype: float64

In [40]:
datf.sum(axis=0)

one      1.726394
two     -3.094990
three   -4.035896
dtype: float64

In [41]:
datf
datf.cumsum(axis=0) #cummulative sum on row
datf.cumsum(axis=1) #cummulative sum on colums

        one       two     three
0 -0.416758 -0.056267 -2.136196
1  1.640271 -1.793436 -0.841747
2  0.502881 -1.245288 -1.057952

        one       two     three
0 -0.416758 -0.056267 -2.136196
1  1.223513 -1.849702 -2.977943
2  1.726394 -3.094990 -4.035896

        one       two     three
0 -0.416758 -0.473025 -2.609221
1  1.640271 -0.153165 -0.994912
2  0.502881 -0.742407 -1.800359

In [42]:
datf
datf.describe()

        one       two     three
0 -0.416758 -0.056267 -2.136196
1  1.640271 -1.793436 -0.841747
2  0.502881 -1.245288 -1.057952

            one       two     three
count  3.000000  3.000000  3.000000
mean   0.575465 -1.031663 -1.345299
std    1.030433  0.888068  0.693416
min   -0.416758 -1.793436 -2.136196
25%    0.043062 -1.519362 -1.597074
50%    0.502881 -1.245288 -1.057952
75%    1.071576 -0.650777 -0.949850
max    1.640271 -0.056267 -0.841747

# Read CSV file and creating dataframe

In [43]:
cars_df=pd.read_csv(Dataset+'/cars.csv')

In [44]:
cars_df.head(20)

,Model,Actual_MPG,Cylinders,Engine_Disp,Horsepower,Weight,Accelerate,Year,Origin
0,amc ambassador dpl,15.0,8,390.0,190,3850,8.5,70,American
1,amc gremlin,21.0,6,199.0,90,2648,15.0,70,American
2,amc hornet,18.0,6,199.0,97,2774,15.5,70,American
3,amc rebel sst,16.0,8,304.0,150,3433,12.0,70,American
4,buick estate wagon (sw),14.0,8,455.0,225,3086,10.0,70,American
5,buick skylark 320,15.0,8,350.0,165,3693,11.5,70,American
6,chevrolet chevelle malibu,18.0,8,307.0,130,3504,12.0,70,American
7,chevrolet impala,14.0,8,454.0,220,4354,9.0,70,American
8,chevrolet monte carlo,15.0,8,400.0,150,3761,9.5,70,American
9,chevy c20,10.0,8,307.0,200,4376,15.0,70,American
10,dodge challenger se,15.0,8,383.0,170,3563,10.0,70,American
11,dodge d200,11.0,8,318.0,210,4382,13.5,70,American
12,ford f250,10.0,8,360.0,215,4615,14.0,70,American
13,ford galaxie 500,15.0,8,429.0,198,4341,10.0,70,American
14,ford maverick,21.0,6,200.0,85,2587,16.0,70,American
15,ford torino,17.0,8,302.0,140,3449,10.5,70,American
16,hi 1200d,9.0,8,304.0,193,4732,18.5,70,American
17,plymouth 'cuda 340,14.0,8,340.0,160,3609,8.0,70,American
18,plymouth duster,22.0,6,198.0,95,2833,15.5,70,American
19,plymouth fury iii,14.0,8,440.0,215,4312,8.5,70,American

In [45]:
cars_df.tail(20)

,Model,Actual_MPG,Cylinders,Engine_Disp,Horsepower,Weight,Accelerate,Year,Origin
372,ford fairmont futura,24.0,4,140.0,92,2865,16.4,82,American
373,ford granada l,22.0,6,232.0,112,2835,14.7,82,American
374,ford mustang gl,27.0,4,140.0,86,2790,15.6,82,American
375,ford ranger,28.0,4,120.0,79,2625,18.6,82,American
376,mercury lynx l,36.0,4,98.0,70,2125,17.3,82,American
377,oldsmobile cutlass ciera (diesel),38.0,6,262.0,85,3015,17.0,82,American
378,plymouth horizon miser,38.0,4,105.0,63,2125,14.7,82,American
379,pontiac j2000 se hatchback,31.0,4,112.0,85,2575,16.2,82,American
380,pontiac phoenix,27.0,4,151.0,90,2735,18.0,82,American
381,volkswagen rabbit l,36.0,4,105.0,74,1980,15.3,82,European
382,vw pickup,44.0,4,97.0,52,2130,24.6,82,European
383,datsun 310 gx,38.0,4,91.0,67,1995,16.2,82,Japanese
384,honda accord,36.0,4,107.0,75,2205,14.5,82,Japanese
385,honda civic,38.0,4,91.0,67,1965,15.0,82,Japanese
386,honda civic (auto),32.0,4,91.0,67,1965,15.7,82,Japanese
387,mazda glc custom,31.0,4,91.0,68,1970,17.6,82,Japanese
388,mazda glc custom l,37.0,4,91.0,68,2025,18.2,82,Japanese
389,nissan stanza xe,36.0,4,120.0,88,2160,14.5,82,Japanese
390,toyota celica gt,32.0,4,144.0,96,2665,13.9,82,Japanese
391,toyota corolla,34.0,4,108.0,70,2245,16.9,82,Japanese

In [46]:
cars_df.sample(20)

,Model,Actual_MPG,Cylinders,Engine_Disp,Horsepower,Weight,Accelerate,Year,Origin
32,chevrolet chevelle malibu,17.0,6,250.0,100,3329,15.5,71,American
142,opel manta,26.0,4,97.0,78,2300,14.5,74,European
15,ford torino,17.0,8,302.0,140,3449,10.5,70,American
214,buick opel isuzu deluxe,30.0,4,111.0,80,2155,14.8,77,American
69,mercury marquis,11.0,8,429.0,208,4633,11.0,72,American
169,pontiac catalina,16.0,8,400.0,170,4668,11.5,75,American
94,chevrolet nova custom,16.0,6,250.0,100,3278,18.0,73,American
212,toyota corolla,28.0,4,97.0,75,2155,16.4,76,Japanese
205,peugeot 504,19.0,4,120.0,88,3270,21.9,76,European
312,ford fairmont,26.4,4,140.0,88,2870,18.1,80,American
261,plymouth sapporo,23.2,4,156.0,105,2745,16.7,78,American
70,oldsmobile delta 88 royale,12.0,8,350.0,160,4456,13.5,72,American
193,dodge d100,13.0,8,318.0,150,3755,14.0,76,American
20,plymouth satellite,18.0,8,318.0,150,3436,11.0,70,American
381,volkswagen rabbit l,36.0,4,105.0,74,1980,15.3,82,European
203,mercedes-benz 280s,16.5,6,168.0,120,3820,16.7,76,European
368,chrysler lebaron medallion,26.0,4,156.0,92,2585,14.5,82,American
129,chevrolet nova,15.0,6,250.0,100,3336,17.0,74,American
343,plymouth champ,39.0,4,86.0,64,1875,16.4,81,American
131,dodge colt,28.0,4,90.0,75,2125,14.5,74,American

In [47]:
cars_df.columns

Index(['Model', 'Actual_MPG', 'Cylinders', 'Engine_Disp', 'Horsepower',
       'Weight', 'Accelerate', 'Year', 'Origin'],
      dtype='object')

In [48]:
type(cars_df)

pandas.core.frame.DataFrame

In [49]:
cars_df.shape

(392, 9)

In [50]:
cars_df.describe()

,Actual_MPG,Cylinders,Engine_Disp,Horsepower,Weight,Accelerate,Year
count,392.000000,392.000000,392.000000,392.000000,392.000000,392.000000,392.000000
mean,23.445918,5.471939,194.411990,104.469388,2977.584184,15.541327,75.979592
std,7.805007,1.705783,104.644004,38.491160,849.402560,2.758864,3.683737
min,9.000000,3.000000,68.000000,46.000000,1613.000000,8.000000,70.000000
25%,17.000000,4.000000,105.000000,75.000000,2225.250000,13.775000,73.000000
50%,22.750000,4.000000,151.000000,93.500000,2803.500000,15.500000,76.000000
75%,29.000000,8.000000,275.750000,126.000000,3614.750000,17.025000,79.000000
max,46.600000,8.000000,455.000000,230.000000,5140.000000,24.800000,82.000000

In [51]:
cars_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 392 entries, 0 to 391
Data columns (total 9 columns):
Model          392 non-null object
Actual_MPG     392 non-null float64
Cylinders      392 non-null int64
Engine_Disp    392 non-null float64
Horsepower     392 non-null int64
Weight         392 non-null int64
Accelerate     392 non-null float64
Year           392 non-null int64
Origin         392 non-null object
dtypes: float64(3), int64(4), object(2)
memory usage: 24.5+ KB

**Correlation**
```
How factor x1  is co related to x2
```

**Here x2 and x1 is changing in same direction this is called Positive Correlation**
<img src="corr.jpg" width="250"/>
```
Closer its to '1' stronger the positive correlation and in other word its 100% positive correlated
```

**Here x2 and x1 is changing in different direction this is called negative correlation**
<img src="corr2.jpg" width="250"/>
```
Closer its to '-1' stronger the negative correlation and in other word its 100% negative correlated
```

**Here x1 changes but has no effect on x2 this is called No correlation or uncorrelated**
<img src="corr3.jpg" width="250"/>

```Point to remember```
1. Correlation coeficieant can be between +1 and -1
2. If correlation is close to +1 its positive correlated and if its close to -1 its negative correlation and if its 0 then no correlation

```
From below considering "Actual MPG" has strong negative correlation with "weight".
```
```
It means If weight increase Acutal MPG will decrease and vice versa.
```
```
From below considering "Actual MPG" has positive correlation with "Accelerated"/"year".
```
```
It means If Accelerate increase Acutal MPG will increase and vice versa.
```
```
If vehicle is newer Acutal MPG will also increase and vice versa.
```

In [52]:
round(cars_df.corr(),2)

,Actual_MPG,Cylinders,Engine_Disp,Horsepower,Weight,Accelerate,Year
Actual_MPG,1.00,-0.78,-0.81,-0.78,-0.83,0.42,0.58
Cylinders,-0.78,1.00,0.95,0.84,0.90,-0.50,-0.35
Engine_Disp,-0.81,0.95,1.00,0.90,0.93,-0.54,-0.37
Horsepower,-0.78,0.84,0.90,1.00,0.86,-0.69,-0.42
Weight,-0.83,0.90,0.93,0.86,1.00,-0.42,-0.31
Accelerate,0.42,-0.50,-0.54,-0.69,-0.42,1.00,0.29
Year,0.58,-0.35,-0.37,-0.42,-0.31,0.29,1.00

In [54]:
cars_df.head(10)

,Model,Actual_MPG,Cylinders,Engine_Disp,Horsepower,Weight,Accelerate,Year,Origin
0,amc ambassador dpl,15.0,8,390.0,190,3850,8.5,70,American
1,amc gremlin,21.0,6,199.0,90,2648,15.0,70,American
2,amc hornet,18.0,6,199.0,97,2774,15.5,70,American
3,amc rebel sst,16.0,8,304.0,150,3433,12.0,70,American
4,buick estate wagon (sw),14.0,8,455.0,225,3086,10.0,70,American
5,buick skylark 320,15.0,8,350.0,165,3693,11.5,70,American
6,chevrolet chevelle malibu,18.0,8,307.0,130,3504,12.0,70,American
7,chevrolet impala,14.0,8,454.0,220,4354,9.0,70,American
8,chevrolet monte carlo,15.0,8,400.0,150,3761,9.5,70,American
9,chevy c20,10.0,8,307.0,200,4376,15.0,70,American

In [55]:
cars_grp=cars_df.groupby('Model')

In [58]:
cars_grp.head()

,Model,Actual_MPG,Cylinders,Engine_Disp,Horsepower,Weight,Accelerate,Year,Origin
0,amc ambassador dpl,15.0,8,390.0,190,3850,8.5,70,American
1,amc gremlin,21.0,6,199.0,90,2648,15.0,70,American
2,amc hornet,18.0,6,199.0,97,2774,15.5,70,American
3,amc rebel sst,16.0,8,304.0,150,3433,12.0,70,American
4,buick estate wagon (sw),14.0,8,455.0,225,3086,10.0,70,American
5,buick skylark 320,15.0,8,350.0,165,3693,11.5,70,American
6,chevrolet chevelle malibu,18.0,8,307.0,130,3504,12.0,70,American
7,chevrolet impala,14.0,8,454.0,220,4354,9.0,70,American
8,chevrolet monte carlo,15.0,8,400.0,150,3761,9.5,70,American
9,chevy c20,10.0,8,307.0,200,4376,15.0,70,American
10,dodge challenger se,15.0,8,383.0,170,3563,10.0,70,American
11,dodge d200,11.0,8,318.0,210,4382,13.5,70,American
12,ford f250,10.0,8,360.0,215,4615,14.0,70,American
13,ford galaxie 500,15.0,8,429.0,198,4341,10.0,70,American
14,ford maverick,21.0,6,200.0,85,2587,16.0,70,American
15,ford torino,17.0,8,302.0,140,3449,10.5,70,American
16,hi 1200d,9.0,8,304.0,193,4732,18.5,70,American
17,plymouth 'cuda 340,14.0,8,340.0,160,3609,8.0,70,American
18,plymouth duster,22.0,6,198.0,95,2833,15.5,70,American
19,plymouth fury iii,14.0,8,440.0,215,4312,8.5,70,American
20,plymouth satellite,18.0,8,318.0,150,3436,11.0,70,American
21,pontiac catalina,14.0,8,455.0,225,4425,10.0,70,American
22,audi 100 ls,24.0,4,107.0,90,2430,14.5,70,European
23,bmw 2002,26.0,4,121.0,113,2234,12.5,70,European
24,peugeot 504,25.0,4,110.0,87,2672,17.5,70,European
25,saab 99e,25.0,4,104.0,95,2375,17.5,70,European
26,volkswagen 1131 deluxe sedan,26.0,4,97.0,46,1835,20.5,70,European
27,datsun pl510,27.0,4,97.0,88,2130,14.5,70,Japanese
28,toyota corona mark ii,24.0,4,113.0,95,2372,15.0,70,Japanese
29,amc gremlin,19.0,6,232.0,100,2634,13.0,71,American
...,...,...,...,...,...,...,...,...,...
362,buick century limited,25.0,6,181.0,110,2945,16.4,82,American
363,chevrolet camaro,27.0,4,151.0,90,2950,17.3,82,American
364,chevrolet cavalier,28.0,4,112.0,88,2605,19.6,82,American
365,chevrolet cavalier 2-door,34.0,4,112.0,88,2395,18.0,82,American
366,chevrolet cavalier wagon,27.0,4,112.0,88,2640,18.6,82,American
367,chevy s-10,31.0,4,119.0,82,2720,19.4,82,American
368,chrysler lebaron medallion,26.0,4,156.0,92,2585,14.5,82,American
369,dodge aries se,29.0,4,135.0,84,2525,16.0,82,American
370,dodge charger 2.2,36.0,4,135.0,84,2370,13.0,82,American
371,dodge rampage,32.0,4,135.0,84,2295,11.6,82,American
372,ford fairmont futura,24.0,4,140.0,92,2865,16.4,82,American
373,ford granada l,22.0,6,232.0,112,2835,14.7,82,American
374,ford mustang gl,27.0,4,140.0,86,2790,15.6,82,American
375,ford ranger,28.0,4,120.0,79,2625,18.6,82,American
376,mercury lynx l,36.0,4,98.0,70,2125,17.3,82,American
377,oldsmobile cutlass ciera (diesel),38.0,6,262.0,85,3015,17.0,82,American
378,plymouth horizon miser,38.0,4,105.0,63,2125,14.7,82,American
379,pontiac j2000 se hatchback,31.0,4,112.0,85,2575,16.2,82,American
380,pontiac phoenix,27.0,4,151.0,90,2735,18.0,82,American
381,volkswagen rabbit l,36.0,4,105.0,74,1980,15.3,82,European
382,vw pickup,44.0,4,97.0,52,2130,24.6,82,European
383,datsun 310 gx,38.0,4,91.0,67,1995,16.2,82,Japanese
384,honda accord,36.0,4,107.0,75,2205,14.5,82,Japanese
385,honda civic,38.0,4,91.0,67,1965,15.0,82,Japanese
386,honda civic (auto),32.0,4,91.0,67,1965,15.7,82,Japanese
387,mazda glc custom,31.0,4,91.0,68,1970,17.6,82,Japanese
388,mazda glc custom l,37.0,4,91.0,68,2025,18.2,82,Japanese
389,nissan stanza xe,36.0,4,120.0,88,2160,14.5,82,Japanese
390,toyota celica gt,32.0,4,144.0,96,2665,13.9,82,Japanese
391,toyota corolla,34.0,4,108.0,70,2245,16.9,82,Japanese